// Напишите программу которая отобразит выше имя и адрес

#include <iostream>
using namespace std;
int main() {
	string name;
	name = "Denis";
	cout << name << endl;
	string adres;
	adres = "1360 FULTON ST STE 1. BROOKLYN.";
	cout << adres << endl;
	return 0;
}